# LapSplicePosition Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricArea..::..LapSplicePosition Property
FabricArea Class See Also
---
The fabric lap splice position in the fabric distribution.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public FabricLapSplicePosition LapSplicePosition { get; set; }
```

Visual Basic
---
```text
Public Property LapSplicePosition As FabricLapSplicePosition
	Get
	Set
```

Visual C++
---
```text
public:
property FabricLapSplicePosition LapSplicePosition {
	FabricLapSplicePosition get ();
	void set (FabricLapSplicePosition value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace